app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
    def index
      sortParams = params[:sort]
      ratingParams = params[:ratings]
      @all_ratings = ['G','PG','PG-13','R']
      if ratingParams != nil
        filteredMovies, @chosenRatings = display_based_rating(ratingParams, Movie.all)